Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM1216LS00048.atdf
        <register name="NONSECB" offset="0x58" rw="R" size="4" initval="0x00000002" caption="Peripheral non-secure status - Bridge B">
          <bitfield name="IDAU_" caption="IDAU Non-Secure" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU Non-Secure" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL Non-Secure" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC Non-Secure" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS Non-Secure" mask="0x10"/>
          <bitfield name="USB_" caption="USB Non-Secure" mask="0x20"/>
        </register>
        <register name="NONSECC" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="Peripheral non-secure status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS Non-Secure" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 Non-Secure" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 Non-Secure" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 Non-Secure" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 Non-Secure" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 Non-Secure" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 Non-Secure" mask="0x40"/>
          <bitfield name="TC0_" caption="TC0 Non-Secure" mask="0x80"/>
          <bitfield name="TC1_" caption="TC1 Non-Secure" mask="0x100"/>
          <bitfield name="TC2_" caption="TC2 Non-Secure" mask="0x200"/>
          <bitfield name="TCC0_" caption="TCC0 Non-Secure" mask="0x400"/>
          <bitfield name="TCC1_" caption="TCC1 Non-Secure" mask="0x800"/>
          <bitfield name="TCC2_" caption="TCC2 Non-Secure" mask="0x1000"/>
          <bitfield name="TCC3_" caption="TCC3 Non-Secure" mask="0x2000"/>
          <bitfield name="ADC_" caption="ADC Non-Secure" mask="0x4000"/>
          <bitfield name="DAC_" caption="DAC Non-Secure" mask="0x8000"/>
          <bitfield name="PTC_" caption="PTC Non-Secure" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG Non-Secure" mask="0x20000"/>
          <bitfield name="CCL_" caption="CCL Non-Secure" mask="0x40000"/>
          <bitfield name="I2S_" caption="I2S Non-Secure" mask="0x80000"/>
          <bitfield name="OPAMP_" caption="OPAMP Non-Secure" mask="0x100000"/>
          <bitfield name="TRAM_" caption="TRAM Non-Secure" mask="0x200000"/>
        </register>
        <register name="SECLOCKA" offset="0x74" rw="R" size="4" initval="0x00000000" caption="Peripheral secure status locked - Bridge A">
          <bitfield name="PAC_" caption="PAC Secure Status Locked" mask="0x1"/>
          <bitfield name="PM_" caption="PM Secure Status Locked" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK Secure Status Locked" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC Secure Status Locked" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL Secure Status Locked" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL Secure Status Locked" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC Secure Status Locked" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK Secure Status Locked" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT Secure Status Locked" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC Secure Status Locked" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC Secure Status Locked" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM Secure Status Locked" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT Secure Status Locked" mask="0x1000"/>
          <bitfield name="AC_" caption="AC Secure Status Locked" mask="0x2000"/>
        </register>
        <register name="SECLOCKB" offset="0x78" rw="R" size="4" initval="0x00000003" caption="Peripheral secure status locked - Bridge B">
          <bitfield name="IDAU_" caption="IDAU Secure Status Locked" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU Secure Status Locked" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL Secure Status Locked" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC Secure Status Locked" mask="0x8"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS Secure Status Locked" mask="0x10"/>
          <bitfield name="USB_" caption="USB Secure Status Locked" mask="0x20"/>
        </register>
        <register name="SECLOCKC" offset="0x7C" rw="R" size="4" initval="0x00000000" caption="Peripheral secure status locked - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS Secure Status Locked" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 Secure Status Locked" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 Secure Status Locked" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 Secure Status Locked" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 Secure Status Locked" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 Secure Status Locked" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 Secure Status Locked" mask="0x40"/>
          <bitfield name="TC0_" caption="TC0 Secure Status Locked" mask="0x80"/>
          <bitfield name="TC1_" caption="TC1 Secure Status Locked" mask="0x100"/>
          <bitfield name="TC2_" caption="TC2 Secure Status Locked" mask="0x200"/>
          <bitfield name="TCC0_" caption="TCC0 Secure Status Locked" mask="0x400"/>
          <bitfield name="TCC1_" caption="TCC1 Secure Status Locked" mask="0x800"/>
          <bitfield name="TCC2_" caption="TCC2 Secure Status Locked" mask="0x1000"/>
          <bitfield name="TCC3_" caption="TCC3 Secure Status Locked" mask="0x2000"/>
          <bitfield name="ADC_" caption="ADC Secure Status Locked" mask="0x4000"/>
          <bitfield name="DAC_" caption="DAC Secure Status Locked" mask="0x8000"/>
          <bitfield name="PTC_" caption="PTC Secure Status Locked" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG Secure Status Locked" mask="0x20000"/>
          <bitfield name="CCL_" caption="CCL Secure Status Locked" mask="0x40000"/>
          <bitfield name="I2S_" caption="I2S Secure Status Locked" mask="0x80000"/>
          <bitfield name="OPAMP_" caption="OPAMP Secure Status Locked" mask="0x100000"/>
          <bitfield name="TRAM_" caption="TRAM Secure Status Locked" mask="0x200000"/>
          <bitfield name="USB_" caption="USB Secure Status Locked" mask="0x400000"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
        <value name="SETSEC" caption="Set IP secure" value="4"/>
        <value name="SETNONSEC" caption="Set IP non-secure" value="5"/>
        <value name="SECLOCK" caption="Lock IP security value" value="6"/>
      </value-group>
    </module>
