Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM1216LS00048.atdf
    <module name="PM" id="U2240" version="3c0" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="PLCFG" offset="0x2" rw="RW" size="1" initval="0x00" caption="Performance Level Configuration">
          <bitfield name="PLSEL" caption="Performance Level Select" mask="0x3" values="PM_PLCFG__PLSEL"/>
          <bitfield name="PLDIS" caption="Performance Level Disable" mask="0x80"/>
        </register>
        <register name="PWCFG" offset="0x3" rw="RW" size="1" initval="0x00" caption="Power Configuration">
          <bitfield name="RAMPSWC" caption="RAM Power Switch Configuration" mask="0x3" values="PM_PWCFG__RAMPSWC"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="PLRDY" caption="Performance Level Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="PLRDY" caption="Performance Level Ready interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="PLRDY" caption="Performance Level Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Standby Configuration">
          <bitfield name="PDCFG" caption="Power Domain Configuration" mask="0x1" values="PM_STDBYCFG__PDCFG"/>
          <bitfield name="DPGPDSW" caption="Dynamic Power Gating for PDSW" mask="0x10" values="PM_STDBYCFG__DPGPDSW"/>
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for SRAM" mask="0x400"/>
          <bitfield name="BBIASTR" caption="Back Bias for Trust RAM" mask="0x1000"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU, AHBx, and APBx clocks are OFF" value="2"/>
        <value name="STANDBY" caption="ALL clocks are OFF, unless requested by sleepwalking peripheral" value="4"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_PLCFG__PLSEL">
        <value name="PL0" caption="Performance Level 0" value="0x0"/>
        <value name="PL2" caption="Performance Level 2" value="0x2"/>
      </value-group>
      <value-group name="PM_PWCFG__RAMPSWC">
        <value name="64KB" caption="64KB Available" value="0x0"/>
        <value name="48KB" caption="48KB Available" value="0x1"/>
        <value name="32KB" caption="32KB Available" value="0x2"/>
        <value name="16KB" caption="16KB Available" value="0x3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__DPGPDSW">
        <value name="DISABLED" caption="Dynamic Power Gating disabled" value="0"/>
        <value name="ENABLED" caption="Dynamic Power Gating enabled" value="1"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="PDSW power domain switching is handled by hardware." value="0"/>
        <value name="PDSW" caption="PDSW is forced ACTIVE." value="1"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="3.1.0" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="PORT Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="PORT Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="PORT Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
